?- append1(X, Y, [1,2,3]).
X = [],
Y = [1, 2, 3] ;
X = [1],
Y = [2, 3] ;
X = [1, 2],
Y = [3] ;
X = [1, 2, 3],
Y = [] ;
false.

?- prefix(X, [1,2,3]).
X = [] ;
X = [1] ;
X = [1, 2] ;
X = [1, 2, 3] ;
false.

?- suffix(X, [1,2,3]).
X = [1, 2, 3] ;
X = [2, 3] ;
X = [3] ;
X = [] ;
false.

?- member1(X, [1,2,3]).
X = 1 ;
X = 2 ;
X = 3 ;
false.

?- first_element(X, [1,2,3]).
X = 1.

?- last_element(X, [1,2,3]).
X = 3 ;
false.

?- two_adjacent(X, Y, [1,2,3,4]).
X = 1,
Y = 2 ;
X = 2,
Y = 3 ;
X = 3,
Y = 4 ;
false.

?- three_adjacent(X, Y, Z, [1,2,3,4,5]).
X = 1,
Y = 2,
Z = 3 ;
X = 2,
Y = 3,
Z = 4 ;
X = 3,
Y = 4,
Z = 5 ;
false.

?- select(1, [1,2,3,21,1,2,1], X).
X = [2, 3, 21, 1, 2, 1] ;
X = [1, 2, 3, 21, 2, 1] ;
X = [1, 2, 3, 21, 1, 2] ;
false.

?- del(3, [1,2,3,2,3,4,3,5,3,1], X).
X = [1, 2, 2, 4, 5, 1] ;
false.

?- append_element(213, [1,2,3], X).
X = [1, 2, 3, 213].

?- insert_element(2, [1,4,9], X).
X = [2, 1, 4, 9] ;
X = [1, 2, 4, 9] ;
X = [1, 4, 2, 9] ;
X = [1, 4, 9, 2] ;
false.

?- len([1,2,3,2,5,1], N).
N = 6.

?- reverse([1,2,3,4,5,6,7], X).
X = [7, 6, 5, 4, 3, 2, 1].

?- palindrome([1,2]).
false.

?- palindrome([1,1]).
true.

?- palindrome([1,0,0,1,0,0,1]).
true.
