?- append1(X, Y, [1,2,3]).
X = [],
Y = [1, 2, 3] ;
X = [1],
Y = [2, 3] ;
X = [1, 2],
Y = [3] ;
X = [1, 2, 3],
Y = [] ;
false.

?- prefix(X, [1,2,3]).
X = [] ;
X = [1] ;
X = [1, 2] ;
X = [1, 2, 3] ;
false.

?- suffix(X, [1,2,3]).
X = [1, 2, 3] ;
X = [2, 3] ;
X = [3] ;
X = [] ;
false.

?- member1(X, [1,2,3]).
X = 1 ;
X = 2 ;
X = 3 ;
false.

?- first_element(X, [1,2,3]).
X = 1.

?- last_element(X, [1,2,3]).
X = 3 ;
false.

?- two_adjacent(X, Y, [1,2,3,4]).
X = 1,
Y = 2 ;
X = 2,
Y = 3 ;
X = 3,
Y = 4 ;
false.

?- three_adjacent(X, Y, Z, [1,2,3,4,5]).
X = 1,
Y = 2,
Z = 3 ;
X = 2,
Y = 3,
Z = 4 ;
X = 3,
Y = 4,
Z = 5 ;
false.


