?- male('Prince Philip').
true.

?- male('Princess Diana').
false.

?- female('Princess Diana').
true.

?- female('Prince Philip').
false.

?- parent('Prince Philip').
true.

?- parent('Princess Beatrice').
false.

?- mother('Prince William').
false.

?- father('Ilya').
false.

?- mother('Prince Philip').
false.

?- father('Prince Philip').
true.

?- mother('Princess Diana').
true.

?- father('Princess Diana').
false.

?- siblings2('Princess Diana', 'Prince Philip').
false.

?- siblings2('Prince William', 'Prince Harry').
true ;
false.

?- siblings2('Prince Charles', X).
X = 'Princess Anne' ;
X = 'Prince Andrew' ;
X = 'Prince Edward' ;
false.
