?- male('Prince Philip').
true.

?- male('Princess Diana').
false.

?- female('Princess Diana').
true.

?- female('Prince Philip').
false.

?- parent('Prince Philip').
true.

?- parent('Princess Beatrice').
false.

?- mother('Prince William').
false.

?- father('Ilya').
false.

?- mother('Prince Philip').
false.

?- father('Prince Philip').
true.

?- mother('Princess Diana').
true.

?- father('Princess Diana').
false.

?- siblings2('Princess Diana', 'Prince Philip').
false.

?- siblings2('Prince William', 'Prince Harry').
true ;
false.

?- siblings2('Prince Charles', X).
X = 'Princess Anne' ;
X = 'Prince Andrew' ;
X = 'Prince Edward' ;
false.

?- siblings1(X, Y).
X = 'David Armstrong-Jones',
Y = 'Polly Higson' ;
X = 'David Armstrong-Jones',
Y = 'Jasper Cable-Alexander' ;
X = 'David Armstrong-Jones',
Y = 'Lady Frances von Hofmannsthal' ;
X = 'Lady Sarah Chatto',
Y = 'Polly Higson' ;
X = 'Lady Sarah Chatto',
Y = 'Jasper Cable-Alexander' ;
X = 'Lady Sarah Chatto',
Y = 'Lady Frances von Hofmannsthal' ;
X = 'Polly Higson',
Y = 'David Armstrong-Jones' ;
X = 'Polly Higson',
Y = 'Lady Sarah Chatto' ;
X = 'Jasper Cable-Alexander',
Y = 'David Armstrong-Jones' ;
X = 'Jasper Cable-Alexander',
Y = 'Lady Sarah Chatto' ;
X = 'Lady Frances von Hofmannsthal',
Y = 'David Armstrong-Jones' ;
X = 'Lady Frances von Hofmannsthal',
Y = 'Lady Sarah Chatto' ;
false.
